<h1>Функции и процедуры для финансовых вычислений</h1>
<div class="date">01.01.2007</div>


<p>DoubleDecliningBalance Вычисляет амортизационные отчисления на определенном этапе.</p>
<p>FutureValue                 Вычисляет значение вклада через определенный период времени.</p>
<p>InterestPayment         Вычисляет процентную ставку кредита.</p>
<p>InterestRate                 Вычисляет процентную ставку инвестиций.</p>
<p>InternalRateOfReturn         Вычисляет внутреннюю ставку дохода от инвестиций.</p>
<p>NetPresentValue         Вычисляет текущее значение платежа, используя массив с расчетными значениями.</p>
<p>NumberOfPeriods         Вычисляет количество этапов необходимое для погашения кредита.</p>
<p>Payment                 Вычисляет полную сумму погашения кредита на отдельном этапе.</p>
<p>PeriodPayment         Вычисляет необходимую сумму выплат основной части (без процентов) кредита на определенном этапе.</p>
<p>PresentValue                 Определяет текущее значение вклада.</p>
<p>SLNDepreciation         Вычисляет сумму амортизационных отчислений по методу равномерной амортизации.</p>
<p>SYDDepreciation         Вычисляет сумму амортизационных отчислений по методу ускоренной амортизации.</p>
<p>Взято с <a href="https://atrussk.ru/delphi/" target="_blank">https://atrussk.ru/delphi/</a></p>
