<h1>Тригонометрические функции и процедуры</h1>
<div class="date">01.01.2007</div>


<p>ArcCos        Вычисляет арккосинус аргумента.</p>
<p>ArcCosh         Вычисляет гиперболический арккосинус аргумента.</p>
<p>ArcSin                 Вычисляет арксинус аргумента.</p>
<p>ArcSinh         Вычисляет гиперболический арксинус аргумента.</p>
<p>ArcTan         Вычисляет арктангенс аргумента.</p>
<p>ArcTan2         Вычисляет arctg(Y/X).</p>
<p>ArcTanh         Вычисляет гиперболический арктангенс аргумента.</p>
<p>Cos                 Вычисляет косинус аргумента.</p>
<p>Cosh                 Вычисляет гиперболический косинус аргумента.</p>
<p>Cotan                 Вычисляет котангенс аргумента.</p>
<p>Hypot                 Вычисляет длину гипотенузы прямоугольного треугольника.</p>
<p>Sin                 Вычисляет синус аргумента.</p>
<p>SinCos         Вычисляет одновременно синус и косинус аргумента.</p>
<p>Sinh                 Вычисляет гиперболический синус аргумента.</p>
<p>Tan                 Вычисляет тангенс аргумента.</p>
<p>Tanh                 Вычисляет гиперболический тангенс аргумента.</p>
<p>Преобразование тригонометрических единиц измерений</p>
<p>CycleToRad        Преобразовывает значение аргумента из циклов в радианы.</p>
<p>DegToRad        Преобразовывает значение аргумента из градусов в радианы.</p>
<p>GradToRad        Преобразовывает значение аргумента из десятичных градусов (grad) в                         радианы.</p>
<p>RadToCycle        Преобразовывает значение аргумента из радианов в циклы.</p>
<p>RadToDeg        Преобразовывает значение аргумента из радианов в градусы.</p>
<p>RadToGrad        Преобразовывает значение аргумента из радианов в десятичные градусы                         (grad).</p>
<p>Взято с <a href="https://atrussk.ru/delphi/" target="_blank">https://atrussk.ru/delphi/</a></p>
