<h1>Арифметика</h1>
<div class="date">01.01.2007</div>


<p>Abs        Возвращает абсолютное значение аргумента.</p>
<p>Ceil        Округляет значение аргумента в большую сторону.</p>
<p>Exp        Вычисляет значение ex.</p>
<p>Floor        Округляет значение аргумента в меньшую сторону.</p>
<p>Frac        Возвращает дробную часть аргумента.</p>
<p>Frexp        Возвращает мантиссу и экспоненту аргумента.</p>
<p>Int        Возвращает целую часть аргумента.</p>
<p>IntPower        Возводит аргумент X в целочисленную степень Y.</p>
<p>Ldexp        Вычисляет X*2Y.</p>
<p>Ln        Вычисляет натуральный логарифм ln(x).</p>
<p>LnXP1        Вычисляет натуральный логарифм ln(x+1).</p>
<p>Log10        Вычисляет десятичный логарифм.</p>
<p>Log2        Вычисляет логарифм аргумента по основанию 2.</p>
<p>LogN        Вычисляет логарифм аргумента по основанию N.</p>
<p>Max        Возвращает большее из двух чисел.</p>
<p>Min        Возвращает меньшее из двух чисел.</p>
<p>Pi        Возвращает значение числа Пи.</p>
<p>Poly        Вычисляет однородный полином.</p>
<p>Power        Возводит X в степень Y.</p>
<p>Round        Округляет число к ближайшему целому.</p>
<p>Sqr        Вычисляет квадрат аргумента Х.</p>
<p>Sqrt        Вычисляет квадратный корень аргумента Х.</p>
<p>Trunc        Отсекает дробную часть числа.</p>
<p>Взято с <a href="https://atrussk.ru/delphi/" target="_blank">https://atrussk.ru/delphi/</a></p>
