<h1>Пример использования параметров компонентов запросов SQL</h1>
<div class="date">01.01.2007</div>

<div class="author">Автор: Akella</div>

<p>Пример использования параметров компонентов запросов SQL</p>
<p>
<a href="/zip/12_1.zip">
 Пример использования параметров компонентов запросов SQL
 и взаимодействия таких компонентов на основе передачи значений
 параметров
</a>
</p>

<p>Взято с Vingrad.ru <a href="https://forum.vingrad.ru" target="_blank">https://forum.vingrad.ru</a></p>
