<h1>Что такое репликация?</h1>
<div class="date">01.01.2007</div>

<p>Репликацией обычно называют процесс синхронизации данных между несколькими БД.</p>
<p>Наиболее развитые SQL-сервера содержат встроенные средства репликации. Для остальных могут быть использованы продукты сторонних фирм.</p>
<p>Одностороняя репликация подразумевает изменение данных только в одной базе, с последующей передачей изменений на остальные. Соответственно, довольно проста в реализации и надежна в работе.</p>
<p>Двустороняя репликация предоставляет гораздо более мощный инструмент распределенной работы между SQL-серверами. Плата за это &mdash; сложность и большая вероятность конфликтов при работе.</p>

<p><a href="https://delphiworld.narod.ru/" target="_blank">https://delphiworld.narod.ru/</a></p>
<p>DelphiWorld 6.0</p>
