<h1>Загрузка последних версий</h1>

	<p><strong>DRKB 3.0</strong> (standalone, кроссплатформенная версия) доступна в следующих вариантах:</p>
	<ul>
		<li><a href="drkb3_full.zip">Полная версия</a>: чуть меньше <strong>30</strong> МБ, формат — CHM. Содержит более <strong>4000</strong> статей.</li>
		<li><a href="drkb3_light.zip">Облегченая версия</a>: около <strong>15</strong> МБ, формат — CHM. По сравнению с полной версией из нее исключены почти все большие статьи, справочные материалы, разделы Kylix, програмирование <nobr>DirectX/OpenGL</nobr>, сильно сокращены разделы работы с <nobr>COM/CORBA/MIDAS</nobr> и многие другие. Эта версия только для тех, кто по каким-либо причинам не может скачать полную версию.</li>
		<li><a href="drkb3_kylix.zip">DRKB Kylix</a> — oколо 2 МБ, формат — CHM. Cодержит только статьи по Kylix (полная версия эти статьи тоже содержит).</li>
		<li><a href="drkb3_algorithms.zip">DRKB Algorithms</a> — Около 3.5 МБ, формат — CHM, содержит статьи по реализации алгоритмов и рассчитана главным образом на студентов, которых не столько интересует програмирование, сколько реализация алгоритмов (полная версия эти статьи тоже содержит).</li>
	</ul>

<h2>Предыдущие версии</h2>

	<ul>
		<li><a href="drkb23.zip">Версия 2.3</a> — хоть и более ранняя, но довольно полная версия базы: компромисс между размером файла и объемом информации (<strong>10</strong> МБ).<p></p></li>
		<li><a href="drkb22.zip">Версия 2.2</a> — почти то же, что и предыдущий пункт (<strong>5.7</strong> МБ).</li>
		<li><a href="drkb20.zip">Delphist's FAQ 2.0</a> — раньше DRKB выходила под этим названием (<strong>4.3</strong> МБ).</li>
		<li><a href="drkb10.zip">Delphist's FAQ 1.0</a> — самая первая версия DRKB (<strong>2.7</strong> МБ).</li>
	</ul>
