<h1>Объектное ориентирование</h1>

<div class="note">
Примечание от Vit:
</div>

<p>
В раздел помещены не только вопросы по объектно-ориентированному программированию
и ООП модели Дельфи, но и часть специфических вопросов по организации VCL.
Я решил не выносить их отдельно в VCL, так как считаю вполне логичным собрать всё в одном разделе.
</p>
<p>
* &quot;Объектное ориентирование&quot; - мой полушутливый термин идеологии ООП,
тем ни менее вполне оправдывающий своё название.
Прошу очень серьёзных дядей и тётей с критикой термина подождать хотя бы до следующего тысячелетия :)
</p>
<h1>Объектное ориентирование</h1>

