<h1>Программный класс для вывода информации о системном трее</h1>
<div class="date">01.01.2007</div>


<p>Программный класс для вывода информации о системном трее</p>
<p>Показывает все иконки, добавленные в трей, их подсказки и приложенпие, добавившее иконку.<br>
В качестве возможностей класса, добавлена возможность удаления любой иконки.<br>
Минус данного класа в том, что заточен исключительно под ХР, на то он и пример :)<br>
<p>&nbsp;</p>
<p><a href="/zip/fwsystrayinfo.zip">Скачать демонстрационный пример</a>
</p>
<p>Александр (Rouse_) Багель</p>
<p><a href="https://rouse.drkb.ru" target="_blank">https://rouse.drkb.ru</a></p>
