<h1>Что такое иконка на System Tray?</h1>
<div class="date">01.01.2007</div>


<p>Иконка  на  Tray'е    это   просто   картинка,   а   не  окно  какой-либо   программы  (исследование  системы  с  помощью Microsoft Spy++ for  Windows  95  показывает,  что  это  не окно вообще).  System Tray  отслеживает  события  мыши  над  иконкой и, в случае  надобности, показывает  ToolTip для этой иконки. Так же он отсылает сообщения о  всех действиях мыши над иконкой окну, которое поместило иконку на Tray. Таким  образом,  нельзя  поместить  программу  на  Tray.  Любая  программа  может  добавить  стоько  иконок  на  Tray,  сколько ей  необходимо.  При  этом главное окно программы не обязано исчезать  или  минимизироватся  - примером может служить Microsoft Internet  Mail,  помещающая  иконку  " конверт"   на  Tray в случае появления  новых писем.</p>

<p>Взято из FAQ:</p>
<a href="https://blackman.km.ru/myfaq/cont4.phtml]http://blackman.km.ru/myfaq/cont4.phtml" target="_blank">https://blackman.km.ru/myfaq/cont4.phtml]http://blackman.km.ru/myfaq/cont4.phtml</a></p>

