<h1>Самый продвинутый TDBGrid</h1>
<div class="date">01.01.2007</div>


<p>Самый продвинутый DBGrid можно найти здесь: <a href="https://www.ehlib.com" target="_blank">https://www.ehlib.com</a></p>
<p>Вот краткое описание, которое дал Петрович:</p>

<p>Для всех работающих с DBGrid да и вообще с DataAware-компонентами, очень рекомендую бесплатную библиотеку EhLib (Сайт разработчика). В ней есть небольшой, но ОЧЕНЬ мощный набор визуальных компонент для работы с БД. В частности DBGridEh в котором реализованы: многострочные заголовки, сортировка при шелчке по заголовку колонки (включая сортировку по нескольким колонкам), инкрементальный поиск, фильтрование записей, агрегативные функции, и много других возможностей. Причем все это реализуется для большинства DataSet'ов (BDE, ADO, ...), более того, можно подключить и еще не существующие.</p>
<p>Библиотека бесплатна для росийских пользователей, и включает исходные тексты.</p>
<p>Сам уже полгода пользуюсь, теперь стандартные компоненты страницы DataControl в дельфи мне не нужны!&nbsp; </p>

<div class="author">Автор: Петрович</div>
<p>Взято из <a href="https://forum.sources.ru" target="_blank">https://forum.sources.ru</a></p>

