<h1>Редактор линий</h1>
<div class="date">01.01.2007</div>


<p>Используйте редактор линий для изменения стиля и толщины линии или границ графических примитивов. Панель редактора линий имеет несколько вариантов для выбора стиля линии (непрерывная или комбинация точек и тире).</p>
<p>Для смены стиля линии, сначала выберите линию или графический примитив, затем выберите размер в пунктах из Hairline. Окончательно выберите стиль линии.</p>
<p>Для смены толщины непрерывной линии, сначала выберите линию или графический примитив, затем выберите требуемый размер.</p>
<p>Стиль линии (тире, точки), появляется только тогда, когда толщина линии выбрана как  hairline. Если линия установлена в определенный стиль (например, тире) и затем ей присваивается толщина, другая чем hairline, то стиль линии изменяется на непрерывный.</p>
<p></p>
