<h1>Панели утилит</h1>
<div class="date">01.01.2007</div>


<p>Есть панели и есть панели</p>
<p>Несмотря на то, что все панели названы панелями, на самом деле есть два различных типа, отличающихся типом функций, это панели инструментов и панели компонент.</p>
<p>Инструменты обычно предназначены для изменения элементов, расположенных на странице, обычно компоненты. А компоненты это объекты, помещаемые на страницу, например регион (Region), графические примитивы (Shape), линии (Line) и штрих коды (Barcode). Для более подробной информации смотрите главу «Обзор компонент».</p>
<p>В данной главе мы рассмотрим панели инструментов, на которых расположены (палитра цветов, инструменты выравнивания и другие.), предназначенные для изменения компонент. Панели инструментов включают: панель выравнивания (Alignment), панель палитры цветов (Color Palette), панели заполнения (Fill), панель редактора шрифтов (Font Editor), панель редактора линий (Line Editor), панели проекта (Project) и панель масштабирования (Zoom).</p>
<p>Использование инструмента</p>
<p>Панели утилит над компонентами и дизайнером страниц. Компонент на странице должен быть выбран до использования панели. Например, для изменения цвета заполнения квадрата, выберите квадрат,&nbsp; затем выберите нужный цвет.</p>
<p>С помощью правой мышки, выберите компонент, и появится контекстное меню, позволяя доступ до пунктов изменения компонента. Данные функции доступны также и с панелей, но просто контекстное меню дает быстрый и простой доступ.</p>

<h1>Панели утилит</h1>

<?php
article_list();
