<h1>О DelphiX</h1>
<div class="date">01.01.2007</div>


<p>DelphiX - плагин под Дельфи, но не простой, а... нет, и не золотой, он очень нужный! Нужнее DelphiX'а есть только один другой плагин - RX Library, но о нем в другой секции. Но что же это за плагин такой? ДельфиИкс - маленький модуль для Дельфей, который позволяет работать с DirectX под Delphi. С названием разобрались, теперь надо разобраться с тем, как он работает. В состав ДельфИкса входят: DXDraw, DXDib, DXImagelist, DX3D, DXSound, DXWave, DXWaveList, DXInput, DXPlay, DXSpriteEngine, DXTimer, DXPaintBox. Теперь расскажу о каждом понемногу:</p>

<p>DXDraw</p>
основной компонент ДельфИкса, это его "рабочий стол", на котором отображается все остальное.</p>

<p>DXDib</p>
абсолютно ненужный компонент, не знаю зачем он здесь...</p>

<p>DXImagelist</p>
компонент для работы с файлами графики, контейнер, куда пихают все картинки</p>

<p>DX3D</p>
комментарии излишни...</p>

<p>DXSound</p>
компонент для доступа к библиотеке DirectX dxsound.dll</p>

<p>DXWave</p>
то же, что и DXDib</p>

<p>DXWaveList</p>
то же, что и DXImageList, но для звука</p>

<p>DXInput</p>
Этот компонент должен служить для ввода данных с клавиатуры, мышки и джойстика</p>

<p>DXPlay</p>
компонент для создания мультиплеера</p>

<p>DXSpriteEngine</p>
то же, что и DXSound, но для графики</p>

<p>DXTimer</p>
обычный таймер. но с немного расширенными возможностями</p>

<p>DXPaintBox - ???</p>

<p>Скачать ДельфИкс вы сможете на сайте http://instrumentari.narod.ru</p><p>Взято с <a href="https://delphiworld.narod.ru" target="_blank">https://delphiworld.narod.ru</a></p>
