<h1>Какой формат данных предпочесть в Delphi? DBase или Paradox?</h1>
<div class="date">01.01.2007</div>


<p>Если вам действительно все равно, то вот несколько пунктов "за" формат Paradox:</p>

<p>1. Широкий выбор типов полей, включая автоинкремент, BLOBs, и т.п.</p>
<p>2. Соблюдение целостности данных, контроля данных, обновления индексов на уровне ядра BDE.</p>
<p>3. Первичный индекс таблицы автоматически соблюдает уникальность записей, вторичные индексы обеспечивают отсортированный "вид" на записи таблицы.</p>
<p>Copyright © 1996 Epsylon Technologies</p>
<p>Взято из FAQ Epsylon Technologies (095)-913-5608; (095)-913-2934; (095)-535-5349</p>
