<h1>Alexa Rank, Google PR, Yandex тИЦ</h1>
<div class="date">01.01.2007</div>

<p>Alexa Rank, Google PR, Yandex тИЦ.</p>
<p>Данный программный класс, в результате своей работы, получает текущие индексы страницы с трех самых популярных ресурсов.<br>
Это, прежде всего, Текущий Индекс Цитирования, т.н. Yandex тИЦ, Alexa Rank и соответственно Google Page Rank.<br>
По поводу первых двух ничего сложного нет, выполняется обычный запрос с указанием страницы и разбор вернувшегося XML документа. А вот с Google Page Rank пришлось повозиться.<br>
Google Toolbar при запросе использует контрольную сумму, которая рассчитывается на основании имени ресурса. Сделано это естественно с целью, чтобы вот такие компоненты, как FWPageRank не появилялись в сети и получать значение Google PR можно было только при помощи Google Toolbar.<br>
Но... как говориться, на каждую хитрую... ну вы и сами дальше знаете :)<br>
Польуйтесь :) <br>
<a href="/zip/fwpagerank.zip">Скачать демонстрационный пример</a></p>
<p>Александр (Rouse_) Багель</p>
<p><a href="https://rouse.drkb.ru" target="_blank">https://rouse.drkb.ru</a></p>
