<h1>Можно ли динамически изменять свойство owner компонента во время выполнения программы?</h1>
<div class="date">01.01.2007</div>



<p>Вы можете менять свойство "owner" и после создания компонента с помощью методов InsertComponent() и RemoveComponent().</p>
<p>Взято из</p>
DELPHI VCL FAQ Перевод с английского &nbsp; &nbsp; &nbsp; 
<p>Подборку, перевод и адаптацию материала подготовил Aziz(JINX)</p>
<p>специально для <a href="https://delphi.vitpc.com/" target="_blank">Королевства Дельфи</a></p>


