<h1>Delphi 7. Отличия и особенности</h1>
<div class="date">01.01.2007</div>


<p>Отличий немного, а стоит ли переходить это скорее всего надо по обстоятельствам решать. </p>
<p>1) Исчезли компоненты NetMaster и изменился репортинг - если в поддерживаемых/разрабатываемых программах они используются то переход будет не столь простым</p>
<p>2) Очень многие третьесторонние библиотеки пока не имеют версий для 7х Дельфи - следовательно если они используются то надо ждать</p>
<p>3) Очень много добавилось для поддержки Web/Internet/Soap/XML и т.п. если используются новые интернет технологии то быстрый переход на Дельфи 7 может быть весьма оправдан.</p>
<p>4) Если используется Дельфи для построения стандартных виндовых приложений то отличий можно сказать что почти нет, переход либо можно не делать, либо сделать - так как он будет очень простой.</p>
<p>5) Если Вы разрабатываете компоненты, то естественно нужна поддержка и этой версии</p>
<p class="author">Автор: Vit</p>
<p>Взято с Vingrad.ru <a href="https://forum.vingrad.ru" target="_blank">https://forum.vingrad.ru</a></p>
<hr />
<p>и кстати ещё исчезли компоненты TclienSocket и TServerSocket </p>
<p class="author">Автор: Radmin</p>
<p>Взято с Vingrad.ru <a href="https://forum.vingrad.ru" target="_blank">https://forum.vingrad.ru</a></p>

<hr />

<p>См. также другие статьи:</p>
<p><a href="/vcl/common/86925aa159254abc">Delphi 7 and FastNet Components</a></p>
<p><a href="/ide/problem/c9ab58cb9a4546be">Проблема использования компонентов в D6/7 от предыдущих версий</a></p>
<p><a href="/vcl/form/transparent">Прозрачность в Delphi 6</a></p>
<p><a href="/network/socket/47eb683352974a75">Где TServerSocket и TClientSocket в Delphi 7? </a></p>
