<h1>Функции для работы с памятью</h1>
<div class="date">01.01.2007</div>


<p>Addr &mdash; Возвращает указатель на объект.</p>
<p>AllocMem &mdash; Выделяет на куче блок памяти заданного размера, заполняет его нулями и возвращает указатель на начало блока.</p>
<p>CompareMem &mdash; Выполняет бинарное сравнение двух участков памяти.</p>
<p>GetHeapStatus Возвращает текущее состояние диспетчера памяти.</p>
<p>GetMemoryManager Возвращает значения указателей полей текущего диспетчера памяти.</p>
<p>IsMemoryManagerSet Определяет, используется в настоящий момент диспетчер памяти, установленный по умолчанию, или был установлен другой диспетчер.</p>
<p>Ptr &mdash; Возвращает указатель на адрес памяти, переданный в качестве аргумента.</p>
<p>SizeOf &mdash; Возвращает размер памяти, занимаемый переменной.</p>
<p>SetMemoryManager Устанавливает значения полей диспетчера памяти.</p>
<p>SysFreeMem &mdash; Высвобождает память, используемую динамической переменной.</p>
<p>SysGetMem &mdash; Выделяет блок памяти заданного размера и возвращает указатель на него.</p>
<p>SysReallocMem &mdash; Изменяет размер динамически распределенного блока памяти.</p>
<p>Взято с <a href="https://atrussk.ru/delphi/" target="_blank">https://atrussk.ru/delphi/</a></p>
