<h1>Работа с системным логом событий</h1>
<div class="date">01.01.2007</div>


<p>Работа с системным логом событий.</p>
<p>Программный класс работы с системным логом событий.</p>
<p>Реализованы методы чтения, записи, работа с бэкапом, слежение за изменением лога.</p>
<p>На его основе и для демонстрации возможностей класса, написано демо приложение - аналог стандартного просмоторщика событий.</p>
<p><a href="/zip/evntlog.zip">Скачать демонстрационный пример</a></p>
<p>Александр (Rouse_) Багель</p>
<p><a href="https://rouse.drkb.ru" target="_blank">https://rouse.drkb.ru</a></p>
