<h1>Общие сведения о COM (статья)</h1>
<div class="date">01.01.2007</div>


<p>Эта статья целиком и полностью написана Fantasist'ом, за что ему огромное спасибо.</p>
<p>Хотел я в общих словах расказать основную идею СOM. Когда я понял, что это такое показалась такая простая вещь, что можно коротко рассказать. Но не получилось...</p>
<p>Что ж, будет немного подлиннее.</p>
<p class="author">Автор: Fantasist</p>
<p>Взято с Vingrad.ru <a href="https://forum.vingrad.ru" target="_blank">https://forum.vingrad.ru</a></p>
<h1>Общие сведения о COM (статья)</h1>

<?php
article_list();
