<h1>Операции над числовыми массивами</h1>
<div class="date">01.01.2007</div>


<p>MaxIntValue         Возвращает наибольшее значение целочисленного массива.</p>
<p>MaxValue         Возвращает наибольшее значение числового массива.</p>
<p>Mean                 Вычисляет среднее арифметическое всех значений массива.</p>
<p>MeanAndStdDev Вычисляет среднее арифметическое всех значений массива, и среднее отклонение.</p>
<p>MinIntValue         Возвращает наименьшее значение целочисленного массива.</p>
<p>MinValue         Возвращает наименьшее значение числового массива.</p>
<p>MomentSkewKurtosis Вычисляет среднее значение, дисперсию, отклонение и периодичность.</p>
<p>Norm                 Возвращает Евклидову норму для всех значений массива.</p>
<p>PopnStdDev         Вычисляет среднеквадратичное отклонение для совокупности данных.</p>
<p>PopnVariance         Вычисляет дисперсию совокупности данных.</p>
<p>StdDev         Вычисляет стандартное среднеквадратичное отклонение элементов массива.</p>
<p>Sum                 Вычисляет сумму значений всех элементов числового массива.</p>
<p>SumInt                 Вычисляет сумму значений всех элементов целочисленного массива.</p>
<p>SumOfSquares Вычисляет сумму квадратов всех элементов числового массива.</p>
<p>SumsAndSquares Возвращает сумму элементов и сумму квадратов всех элементов числового массива.</p>
<p>TotalVariance         Вычисляет статистическую дисперсию.</p>
<p>Variance         Вычисляет типовую дисперсию всех значений массива.</p>
<p>Взято с <a href="https://atrussk.ru/delphi/" target="_blank">https://atrussk.ru/delphi/</a></p>
