<h1>Демонстрационная программа получения информации об удаленном компьютере</h1>
<div class="date">01.01.2007</div>

<p>Демонстрационная программа получения информации о удаленном компьютере</p>
<p>Демонстрационная программа получения информации о компьютере на основе IP адреса<br>
Позволяет узнать:<br>
- Имя компьютера<br>
- Список залогиненных пользователей<br>
- Коментарий к компьютеру<br>
- Провайдер (не тот который вы подумали :)<br>
- MAC адрес<br>
- Открытые сетевые ресурсы<br>
- Домен в который входит компьютер<br>
<p>- Если сеть доменная то дополнительно определяет имя сервера домена и группы в которые входит текущий пользователь на удаленной машине...</p>
<p><a href="/zip/infofromip.zip">Скачать демонстрационный пример</a>
</p>
<p>Александр (Rouse_) Багель</p>
<p><a href="https://rouse.drkb.ru" target="_blank">https://rouse.drkb.ru</a></p>

