<h1>Демонстрационный пример сниффера</h1>
<div class="date">01.01.2007</div>


<p>Демонстрационный пример сниффера.<br>
Я не ставил перед собой целью написать что-то революционное,<br>
просто было желание показать сам принцип написания простейшего сниффера,<br>
что я и осуществил :)<br>
Работает на сетевом уровне модели OSI. (W2000 and later) <br>
<p>&nbsp;</p>
<p><a href="/zip/sniffer.zip">Скачать демонстрационный пример</a>
</p>
<div class="author">Автор: Александр (Rouse_) Багель</div>

<p><a href="https://rouse.drkb.ru" target="_blank">https://rouse.drkb.ru</a></p>
