<h1>Чем отличаются «версионники» от «блокировочников»?</h1>
<div class="date">01.01.2007</div>

Классические &#171;блокировочники&#187; не дают возможности разным транзакциям одновременно изменять одни и те же записи, блокируя их на время транзакции. В результате, при попытке изменить заблокированную запись, другая транзакция будет простаивать, пока не завершиться первая. <br>
<p>В свою очередь, &#171;версионники&#187; позволяют одновременно модифицировать одни и те же записи, создавая при этом разные версии одной записи.</p>
<p><a href="https://delphiworld.narod.ru/" target="_blank">https://delphiworld.narod.ru/</a></p>
<p>DelphiWorld 6.0</p>
