<h1>Особенности реализации серверной части</h1>
<div class="date">01.01.2007</div>


<p>MS SQL Server имеет встроенный язык программирования Transact SQL, являющийся процедурным расширением стандарта ANSI SQL 92 entry level. T-SQL имеет полный набор средств для написания хранимых процедур и триггеров. Кроме этого реализованы некоторые расширения стандартного SQL, которые необходимо знать разработчику.</p>

<a href="77727.htm">SELECT</a></p>
<a href="77729.htm">INSERT, UPDATE и DELETE</a></p>
<a href="77730.htm">CREATE TABLE и типы данных</a></p>
<a href="77731.htm">Написание триггеров</a></p>
<a href="77732.htm">Пакеты команд</a></p>
<a href="77733.htm">Обработка ошибок</a></p>
<a href="77734.htm">Блокировки</a></p>
<a href="77735.htm">Обработка транзакций</a></p>
<a href="77736.htm">Соответствие стандарту ANSI SQL 92</a></p>
<a href="77737.htm">Модель безопасности</a></p>
<a href="77738.htm">Оптимизатор запросов MS SQL Server</a></p>
<a href="77739.htm">Получение уникальных идентификаторов</a></p>
<a href="77740.htm">Временные таблицы</a></p>
<a href="77742.htm">Создание хранимых процедур и триггеров</a></p>
<a href="77743.htm">Кластерные индексы</a></p>
<a href="77744.htm">Определяемые пользователем функции</a></p>
<h1>Особенности реализации серверной части</h1>

