<h1>Как использовать базу данных BDE, не указывая её имени?</h1>
<div class="date">01.01.2007</div>


<p>Если база данных находится в той же директории, что и экзешник, то в качестве имени базы можно использовать .\ в поле DatabaseName в TTable</p>
<p>Взято из <a href="https://forum.sources.ru" target="_blank">https://forum.sources.ru</a></p>


<p>Примечания Vit:</p>
<p>1) Если путь другой - то в поле DatabaseName можно прописать путь, например: c:\Program Files\...</p>
<p>2) Прописывание путивместо alias не исключает необходимости использования BDE</p>
