<h1>Пример получения всех окон и их дочерних элементов в системе</h1>
<div class="date">01.01.2007</div>


<p>Пример получения всех окон и их дочерних элементов в системе.</p>
<p>Расширенная версия. <br>
Отображает: класс и заголовок окна, имя модуля и его хэндл, а также PID процесса и языковую раскладку которому принадлежит окно. <br>
<a href="/zip/windowtree.zip">Скачать демонстрационный пример</a>
</p>
<p>Александр (Rouse_) Багель</p>
<p><a href="https://rouse.drkb.ru" target="_blank">https://rouse.drkb.ru</a></p>
