<h1>Функции и процедуры для работы с данными перечислимого типа</h1>
<div class="date">01.01.2007</div>


<p>Dec         Уменьшает значение переменной на заданную величину.</p>
<p>Inc         Увеличивает значение переменной на заданную величину.</p>
<p>Odd         Определяет четность аргумента.</p>
<p>Ord         Возвращает порядковый номер выражения перечислимого типа или код ASCII выражения символьного типа.</p>
<p>Pred         Возвращает значение, предшествующее аргументу.</p>
<p>Succ         Возвращает значение, следующее за аргументом.</p>
<p>Взято с <a href="https://atrussk.ru/delphi/" target="_blank">https://atrussk.ru/delphi/</a></p>
