<h1>Словарь уникальных слов</h1>
<div class="date">01.01.2007</div>


<p>Словарь уникальных слов.</p>
<p>Алгоритм составления словаря всех уникальных слов встречающихся в текстовом файле.<br>
По результатам тестирования: обработка файла объемом 3 Мб (уникальных слов ~63 тысячи)<br>
<p>занимает около 3 секунд. (Можно, конечно, и еще ускорить, но уж лениво сильно ;)</p>
<p><a href="/zip/dict.zip">Скачать демонстрационный пример</a></p>
<p>Александр (Rouse_) Багель</p>
<p><a href="https://rouse.drkb.ru" target="_blank">https://rouse.drkb.ru</a></p>
