<h1>Реализация закладки свойств файла</h1>
<div class="date">01.01.2007</div>


<p>Реализация закладки свойств файла.</p>
<p>Достаточно полезная демка для программистов увлекающихся копанием в РЕ формате.<br>
Выводит список импорта - экспорта выбранного РЕ файла на закладке свойств файла.<br>
Собственно, помимо демо получения самих списков импорта/экспорта показывает работу с IShellPropSheetExt,<br>
при помощи которого реализуется сама закладка, есть работа с активизацией контекста манифеста<br>
(интересно будет тем, кто работает с диалогами под ХР),<br>
в качестве вкусностей - юнит с реализацией функций ImageRvaToVa и ImageDirectoryEntryToData. <br>
Надеюсь данная работа будет вам интересна.<br>
<a href="/zip/propsheet.zip">Скачать демонстрационный пример</a>
</p>
<p> <br>
<p>PS: Для тех, кто будет собирать проект под Delphi версии 6 и ниже потребуются дополнительные файлы.</p>
<p><a href="/zip/uses.zip">Скачать дополнительные файлы</a>
</p>
<p>Александр (Rouse_) Багель</p>
<p><a href="https://rouse.drkb.ru" target="_blank">https://rouse.drkb.ru</a></p>
