<h1>Заключение</h1>
<div class="date">01.01.2007</div>


<p>Если Вы зашли так далеко и поняли все то, о чем я говорил в этой статье - поздравляю Вас! Смотрите, я же говорил, что потоки в COM - это просто. Вы просто должны затратить немного времени, чтобы не спеша понять много нового, но в конце концов потоки они и есть потоки, это просто новое лицо, появляющееся при интеграции с COM. Я надеюсь, что Вы наслаждались чтением этой статьи так же, как я наслаждался написанием этой статьи (и потоковыми моделями).</p>
<p>На этом все. Скоро ждите еще много интересного!</p>
<p>Сайт автора и другие ресурсы по COM www.intac.com/~bly/com/index.htm </p>

