<h1>Набор инструментов для оперирования с дисками на физическом уровне</h1>
<div class="date">01.01.2007</div>


<p>В данном сборнике есть три примера, которые называться<br>
&nbsp;<br>
UnErase, PartitionView, BootView <br>
UnErase &#8211; Программа для восстановления удаленных файлов<br>
PartitionView &#8211; показывает структуру разделов жесткого диска<br>
BootView &#8211; показывает загрузочную запись визуально<br>
&nbsp;<br>
А также модули uFAT, DISK.<br>
uFAT &#8211; готовый код для полноценной работы с файловой системой FAT<br>
uDISK &#8211; ф-ций для работы с дисковыми драйверами R/W для секторов<br>
&nbsp;<br>
ВНИМАНИЕ! Если вы не понимайте и не вникайте в эти понятия как слово сектор<br>
или Partition/Boot/FAT1/FAT2/RootDir/DATA то лучше вообще не запускайте с этого<br>
модуля нечего!!!<br>
Ваша безопасность в ваших руках! <br>
<p>&nbsp;</p>
<p class="author">Автор&nbsp; : NikNet
<p>E-MAIL : NikNet@Yandex.ru</p>
<h1>Набор инструментов для оперирования с дисками на физическом уровне</h1>

