<h1>Набор инструментов для оперирования с дисками на физическом уровне</h1>
<div class="date">01.01.2007</div>


<p>В данном сборнике есть три примера, которые называются<br>
UnErase, PartitionView, BootView.<br>
UnErase - Программа для восстановления удаленных файлов<br>
PartitionView - показывает структуру разделов жесткого диска<br>
BootView - показывает загрузочную запись визуально<br>
<br>
А также модули uFAT, DISK.<br>
uFAT - готовый код для полноценной работы с файловой системой FAT<br>
uDISK - ф-ций для работы с дисковыми драйверами R/W для секторов<br>
 <br>
ВНИМАНИЕ! Если вы не понимаете и не вникаете в такие понятия как сектор<br>
или Partition/Boot/FAT1/FAT2/RootDir/DATA, то лучше вообще не запускайте с этого<br>
модуля нечего!!!<br>
Ваша безопасность в ваших руках! <br>
<p></p>
<div class="author">Автор: NikNet (NikNet@Yandex.ru)</div>
